#+TITLE: Daily Notes:: NMBU towards Sustainable Development Goals
#+AUTHOR: Raju Rimal
#+TODO: TODO(t) IN_PROGRESS | DONE(d!) CANCELED(c@)

* Towards SDG Form Preparation
** DONE Information Collection [0/0]
CLOSED: [2019-11-14 to. 22:54] SCHEDULED: <2019-11-14 to.>
:LOGBOOK:
CLOCK: [2019-11-14 to. 08:46]--[2019-11-14 to. 16:55] =>  8:09
:END:
- Collecting information about SDG, Goals and Targets
- High quality Images, Icons and other related materials
** IN_PROGRESS Scaffold Basic prototype [1/2]
SCHEDULED: <2019-11-15 fr.>
:LOGBOOK:
CLOCK: [2019-11-15 fr. 09:10]--[2019-11-15 fr. 15:30] =>  6:20
:END:
*** DONE Basic Scaffolding with pure HTML, CSS and JavaScript (but difficult to continue with sub-goals)
- Problem with building form conditionally. (Try with ReactJS, I think this simple to start with)
CLOSED: [2019-11-15 sø. 16:05]
*** IN_PROGRESS Use Firebase as back-end and make a small prototype ready (Planned but continue only after few days)
:Resources:
- [[https:https://www.w3schools.com/howto/howto_js_form_steps.asp][W3School Multi Stage Form]]
- [[https:https://dev.to/desoga/connect-registration-form-to-firebase-part-2-53cb][Firebase Database update from HTML form]]
- [[https:https://www.youtube.com/watch?v=PP4Tr0l08NE][Submit form to Firebase only using javascript from TraversyMedia]]
:END:
** TODO Prepare the whole site in ReactJS [4/6]
*** DONE Start with dummy multi-stage form using some tutorial
CLOSED: [2019-11-18 Mon 16:32]
*** DONE Use Material-UI Design for the interface
CLOSED: [2019-11-18 Mon 16:32]
*** TODO Link the form to Firebase database
*** DONE Add Progress Panel to show the stage of form
CLOSED: [2019-11-18 Mon 16:34]
*** DONE Image Grid for SDG logo with logic of selecting at most 2 images
CLOSED: [2019-11-18 Mon 16:33]
:Resources:
- [[https:https://www.youtube.com/watch?v=zT62eVxShsY][Youtube Tutorial for multi-step form with React]]
- [[https:https://www.npmjs.com/package/react-image-picker][Use React-Image-Picker to populate the logo using the following json data]]
- [[https:https://github.com/datapopalliance/SDGs/tree/master/json%2520versions][JSON data for SDG goals, targets and indicators]]
- [[https:https://upmostly.com/tutorials/react-onclick-event-handling-with-examples][Nice tutorial on the differences between class and functional components in React]]
- [[https:https://reactjs.org/docs/hooks-state.html][Another tutorial on the different Hooks (state and props) in React]]
:END:
*** IN_PROGRESS Stages of Development [5/6]
**** DONE Personal Details
CLOSED: [2019-11-18 Mon 16:32]
**** DONE SDG Goals Selection
CLOSED: [2019-11-18 Mon 16:33]
**** DONE SDG Targets Selection
CLOSED: [2019-11-25 ma. 00:21]
- State "DONE"       from "IN_PROGRESS" [2019-11-25 ma. 00:21]
**** DONE Display Summary
CLOSED: [2019-11-25 ma. 00:21]
- State "DONE"       from "IN_PROGRESS" [2019-11-25 ma. 00:21]
**** TODO Submit to Firebase
**** DONE Comfirmation Page (Back to Home)
CLOSED: [2019-11-25 ma. 00:21]
- State "DONE"       from "IN_PROGRESS" [2019-11-25 ma. 00:21]
** DONE Dockerize Application [0/0]
CLOSED: [2019-11-18 Mon 16:35]
** IN_PROGRESS Current state is very confusing and difficult to handle. Restructure the states. [4/7]
- Try to use already created components
- Make the flow of data and information as little as possible
- Overall style can be managed later so focus more on to the functionality
*** DONE Personal Details
CLOSED: [2019-11-21 to. 01:00]
- State "DONE"       from "IN_PROGRESS" [2019-11-21 to. 01:00]
- Make same faculty drop-down for both places
- Name instead of First and Last Name, Research Title and URL, Coauthor Faculties
*** DONE Goal Image Grid
CLOSED: [2019-11-21 to. 00:59]
- State "DONE"       from "IN_PROGRESS" [2019-11-21 to. 00:59]
- Use previously created components just use the new states
*** DONE Targets
CLOSED: [2019-11-25 ma. 00:19]
- State "DONE"       from "IN_PROGRESS" [2019-11-25 ma. 00:19]
- Use previously created components with new states
- It is now complete and it is possible to selection target per group
- Can not be toggled. This needs to be fixed.
*** DONE Interaction
CLOSED: [2019-11-23 lø. 01:28]
- State "DONE"       from "IN_PROGRESS" [2019-11-23 lø. 01:28]
- This section deals with selecting cause and effect with interaction
- Add a button to switch cause and effect (NOT SEPARATED AS CAUSE & EFFECT AT THIS MOMENT)
  - Need some discussions with Solve.
- Add a button to select interaction (+/-)
*** IN_PROGRESS Summary
- Summary of the details that is needed to post to dataset
- Add submit button
- After the sucessful saving of data, test few times and discuss with Solve
:Completed:
- All information are collected and correctly displayed
- Need to connect to firebase and submit the data
:END:
*** TODO Confirmation
- Show the confirmation page
- Add button to go back and add more records
CLOSED: [2019-11-18 Mon 16:32]
:LOGBOOK:
CLOCK: [2019-11-19 Thu 08:45]--[2019-11-19 Thu 15:36] =>  6:51
:END:
*** TODO Mobile Friendly Interface
